import type { LatinVariants } from './type';

export const latinCharactersMap: Record<BaseCharacters, LatinVariants> = {
	A: {
		base: 'A',
		variants: [
			'Á',
			'À',
			'Â',
			'Ǎ',
			'Ă',
			'Ã',
			'Ả',
			'Ȧ',
			'Ạ',
			'Ä',
			'Å',
			'Ḁ',
			'Ā',
			'Ą',
			'Ⱥ',
			'Ȁ',
			'Ấ',
			'Ầ',
			'Ẫ',
			'Ẩ',
			'Ậ',
			'Ắ',
			'Ằ',
			'Ẵ',
			'Ẳ',
			'Ặ',
			'Ǻ',
			'Ǡ',
			'Ǟ',
			'Ȃ',
			'Ɑ',
			'Ɐ',
			'Ａ',
			'Æ',
			'Ǽ',
			'Ǣ'
		]
	},
	a: {
		base: 'a',
		variants: [
			'á',
			'à',
			'â',
			'ǎ',
			'ă',
			'ã',
			'ả',
			'ȧ',
			'ạ',
			'ä',
			'å',
			'ḁ',
			'ā',
			'ą',
			'ᶏ',
			'ⱥ',
			'ȁ',
			'ấ',
			'ầ',
			'ẫ',
			'ẩ',
			'ậ',
			'ắ',
			'ằ',
			'ẵ',
			'ẳ',
			'ặ',
			'ǻ',
			'ǡ',
			'ǟ',
			'ȃ',
			'ɑ',
			'ᴀ',
			'ɐ',
			'ɒ',
			'ａ',
			'æ',
			'ᴁ',
			'ᴭ',
			'ᵆ',
			'ǽ',
			'ǣ',
			'ᴂ'
		]
	},
	B: {
		base: 'B',
		variants: ['Ḃ', 'Ḅ', 'Ḇ', 'Ƀ', 'Ɓ', 'Ｂ']
	},
	b: {
		base: 'b',
		variants: ['ḃ', 'ḅ', 'ḇ', 'ƀ', 'ɓ', 'ᵬ', 'ᶀ', 'ｂ']
	},
	C: {
		base: 'C',
		variants: ['Ć', 'Ĉ', 'Č', 'Ċ', 'Ç', 'Ḉ', 'Ƈ', 'Ȼ', 'Ꞔ', 'Ｃ']
	},
	c: {
		base: 'c',
		variants: ['ć', 'ĉ', 'č', 'ċ', 'ç', 'ḉ', 'ƈ', 'ȼ', 'ꞔ', 'ɕ', 'ｃ']
	},
	D: {
		base: 'D',
		variants: ['Ď', 'Ḋ', 'Ḍ', 'Ḏ', 'Ḑ', 'Ḓ', 'Đ', 'Ɖ', 'Ɗ', 'Ｄ']
	},
	d: {
		base: 'd',
		variants: ['ď', 'ḋ', 'ḍ', 'ḏ', 'ḑ', 'ḓ', 'đ', 'ɖ', 'ɗ', 'ᵭ', 'ᶁ', 'ᶑ', 'ｄ']
	},
	E: {
		base: 'E',
		variants: [
			'É',
			'È',
			'Ê',
			'Ě',
			'Ĕ',
			'Ẽ',
			'Ẻ',
			'Ė',
			'Ë',
			'Ē',
			'Ę',
			'Ȩ',
			'Ɇ',
			'Ȅ',
			'Ế',
			'Ề',
			'Ễ',
			'Ể',
			'Ệ',
			'Ḕ',
			'Ḗ',
			'Ḙ',
			'Ḛ',
			'Ḝ',
			'Ǝ',
			'Ɛ',
			'Ｅ'
		]
	},
	e: {
		base: 'e',
		variants: [
			'é',
			'è',
			'ê',
			'ě',
			'ĕ',
			'ẽ',
			'ẻ',
			'ė',
			'ë',
			'ē',
			'ę',
			'ȩ',
			'ɇ',
			'ȅ',
			'ế',
			'ề',
			'ễ',
			'ể',
			'ệ',
			'ḕ',
			'ḗ',
			'ḙ',
			'ḛ',
			'ḝ',
			'ǝ',
			'ɛ',
			'ᴇ',
			'ｅ',
			'ȇ',
			'ẹ',
			'ⱸ',
			'ə',
			'ᴔ',
			'ᵫ'
		]
	},
	F: {
		base: 'F',
		variants: ['Ḟ', 'Ƒ', 'ꜰ', 'Ｆ']
	},
	f: {
		base: 'f',
		variants: ['ḟ', 'ƒ', 'ᵮ', 'ᶂ', 'ꜰ', 'ｆ', 'ﬀ', 'ﬃ', 'ﬄ', 'ﬁ', 'ﬂ']
	},
	G: {
		base: 'G',
		variants: ['Ǵ', 'Ğ', 'Ĝ', 'Ǧ', 'Ġ', 'Ģ', 'Ḡ', 'Ǥ', 'Ɠ', 'ɢ', 'Ȝ', 'Ｇ', 'Ŋ']
	},
	g: {
		base: 'g',
		variants: ['ǵ', 'ğ', 'ĝ', 'ǧ', 'ġ', 'ģ', 'ḡ', 'ǥ', 'ɠ', 'ᶃ', 'ɢ', 'ȝ', 'ｇ', 'ŋ', 'ɢ̆']
	},
	H: {
		base: 'H',
		variants: ['Ĥ', 'Ȟ', 'Ḧ', 'Ḣ', 'Ḩ', 'Ḥ', 'Ḫ', 'H̱', 'Ħ', 'Ⱨ', 'Ɦ', 'Ꜧ', 'ʜ', 'Ｈ']
	},
	h: {
		base: 'h',
		variants: ['ĥ', 'ȟ', 'ḧ', 'ḣ', 'ḩ', 'ḥ', 'ḫ', 'ẖ', 'ħ', 'ⱨ', 'ɦ', 'ꜧ', 'ʰ', 'ʜ', 'ｈ', 'h̃', 'ɧ']
	},
	I: {
		base: 'I',
		variants: [
			'Í',
			'Ì',
			'Ĭ',
			'Î',
			'Ǐ',
			'Ï',
			'Ḯ',
			'Ĩ',
			'Į',
			'Ī',
			'Ỉ',
			'Ȉ',
			'Ȋ',
			'Ị',
			'Ḭ',
			'Ɨ',
			'İ',
			'I',
			'Ɪ',
			'Ɩ',
			'Ｉ',
			'IJ',
			'Ĳ'
		]
	},
	i: {
		base: 'i',
		variants: [
			'í',
			'ì',
			'ĭ',
			'î',
			'ǐ',
			'ï',
			'ḯ',
			'ĩ',
			'į',
			'ī',
			'ỉ',
			'ȉ',
			'ȋ',
			'ị',
			'ḭ',
			'ɨ',
			'ᵻ',
			'ᶖ',
			'i',
			'ı',
			'ɪ',
			'ɩ',
			'ｉ',
			'ij',
			'ĳ'
		]
	},
	J: {
		base: 'J',
		variants: ['Ĵ', 'Ɉ', 'J̌', 'Ɉ', 'Ᵽ', 'IJ', 'Ĳ', 'LJ', 'Ǉ', 'NJ', 'Ǌ', 'Ｊ']
	},
	j: {
		base: 'j',
		variants: [
			'ĵ',
			'ɉ',
			'ǰ',
			'ȷ',
			'ʝ',
			'ɟ',
			'ʄ',
			'ᴊ',
			'ｊ',
			'ij',
			'ĳ',
			'lj',
			'ǉ',
			'nj',
			'ǌ',
			'ʲ',
			'j̃'
		]
	},
	K: {
		base: 'K',
		variants: ['Ḱ', 'Ǩ', 'Ķ', 'Ḳ', 'Ḵ', 'Ƙ', 'Ⱪ', 'Ꝁ', 'ᴋ', 'Ｋ']
	},
	k: {
		base: 'k',
		variants: ['ḱ', 'ǩ', 'ķ', 'ḳ', 'ḵ', 'ƙ', 'ⱪ', 'ᶄ', 'ꝁ', 'ᴋ', 'ｋ']
	},
	L: {
		base: 'L',
		variants: ['Ĺ', 'Ľ', 'Ļ', 'Ḷ', 'Ḹ', 'Ḽ', 'Ḻ', 'Ł', 'Ŀ', 'Ƚ', 'Ⱡ', 'Ɫ', 'ʟ', 'Ｌ', 'LJ', 'Ǉ']
	},
	l: {
		base: 'l',
		variants: [
			'ĺ',
			'ľ',
			'ļ',
			'ḷ',
			'ḹ',
			'ḽ',
			'ḻ',
			'ł',
			'ŀ',
			'ƚ',
			'ⱡ',
			'ɫ',
			'ɬ',
			'ᶅ',
			'ɭ',
			'ȴ',
			'ʟ',
			'ｌ',
			'lj',
			'ǉ'
		]
	},
	M: {
		base: 'M',
		variants: ['Ḿ', 'Ṁ', 'Ṃ', 'Ɱ', 'ᵯ', 'Ｍ']
	},
	m: {
		base: 'm',
		variants: ['ḿ', 'ṁ', 'ṃ', 'ᵯ', 'ᶆ', 'ɱ', 'ᴍ', 'ｍ']
	},
	N: {
		base: 'N',
		variants: [
			'Ń',
			'Ǹ',
			'Ň',
			'Ñ',
			'Ṅ',
			'Ņ',
			'Ṇ',
			'Ṋ',
			'Ṉ',
			'N̈',
			'Ɲ',
			'Ƞ',
			'ɴ',
			'Ｎ',
			'Ŋ',
			'NJ',
			'Ǌ'
		]
	},
	n: {
		base: 'n',
		variants: [
			'ń',
			'ǹ',
			'ň',
			'ñ',
			'ṅ',
			'ņ',
			'ṇ',
			'ṋ',
			'ṉ',
			'n̈',
			'ɲ',
			'ƞ',
			'ᵰ',
			'ᶇ',
			'ɳ',
			'ȵ',
			'ɴ',
			'ｎ',
			'ŋ',
			'nj',
			'ǌ'
		]
	},
	O: {
		base: 'O',
		variants: [
			'Ó',
			'Ò',
			'Ŏ',
			'Ô',
			'Ố',
			'Ồ',
			'Ỗ',
			'Ổ',
			'Ǒ',
			'Ö',
			'Ȫ',
			'Ő',
			'Õ',
			'Ṍ',
			'Ṏ',
			'Ȭ',
			'Ȯ',
			'Ȱ',
			'Ø',
			'Ǿ',
			'Ǫ',
			'Ǭ',
			'Ō',
			'Ṓ',
			'Ṑ',
			'Ỏ',
			'Ȍ',
			'Ȏ',
			'Ơ',
			'Ớ',
			'Ờ',
			'Ỡ',
			'Ở',
			'Ợ',
			'Ọ',
			'Ộ',
			'Ɵ',
			'Ɔ',
			'Ȣ',
			'ᴏ',
			'Ｏ',
			'Œ'
		]
	},
	o: {
		base: 'o',
		variants: [
			'ó',
			'ò',
			'ŏ',
			'ô',
			'ố',
			'ồ',
			'ỗ',
			'ổ',
			'ǒ',
			'ö',
			'ȫ',
			'ő',
			'õ',
			'ṍ',
			'ṏ',
			'ȭ',
			'ȯ',
			'ȱ',
			'ø',
			'ǿ',
			'ǫ',
			'ǭ',
			'ō',
			'ṓ',
			'ṑ',
			'ỏ',
			'ȍ',
			'ȏ',
			'ơ',
			'ớ',
			'ờ',
			'ỡ',
			'ở',
			'ợ',
			'ọ',
			'ộ',
			'ɵ',
			'ɔ',
			'ȣ',
			'ⱺ',
			'ᴏ',
			'ｏ',
			'œ',
			'ᴔ'
		]
	},
	P: {
		base: 'P',
		variants: ['Ṕ', 'Ṗ', 'Ᵽ', 'Ƥ', 'P̃', 'Ᵽ', 'Ƿ', 'Ｐ']
	},
	p: {
		base: 'p',
		variants: ['ṕ', 'ṗ', 'ᵽ', 'ƥ', 'p̃', 'ᵱ', 'ᶈ', 'ᴘ', 'ƿ', 'ｐ']
	},
	Q: {
		base: 'Q',
		variants: ['Ɋ', 'Ƣ', 'Ꝗ', 'Ｑ']
	},
	q: {
		base: 'q',
		variants: ['ɋ', 'ƣ', 'ʠ', 'ꞯ', 'ｑ']
	},
	R: {
		base: 'R',
		variants: ['Ŕ', 'Ř', 'Ṙ', 'Ŗ', 'Ȑ', 'Ȓ', 'Ṛ', 'Ṝ', 'Ṟ', 'Ɍ', 'Ɽ', 'Ꝛ', 'Ʀ', 'Ｒ']
	},
	r: {
		base: 'r',
		variants: [
			'ŕ',
			'ř',
			'ṙ',
			'ŗ',
			'ȑ',
			'ȓ',
			'ṛ',
			'ṝ',
			'ṟ',
			'ɍ',
			'ɽ',
			'ꝛ',
			'ᵲ',
			'ᶉ',
			'ɼ',
			'ɾ',
			'ᵳ',
			'ʀ',
			'ｒ',
			'ɹ',
			'ʁ'
		]
	},
	S: {
		base: 'S',
		variants: ['Ś', 'Ṥ', 'Ŝ', 'Š', 'Ṧ', 'Ṡ', 'Ş', 'Ṣ', 'Ṩ', 'Ș', 'S̩', 'Ȿ', 'ꜱ', 'Ʃ', 'ẞ', 'Ｓ']
	},
	s: {
		base: 's',
		variants: [
			'ś',
			'ṥ',
			'ŝ',
			'š',
			'ṧ',
			'ṡ',
			'ẛ',
			'ş',
			'ṣ',
			'ṩ',
			'ș',
			's̩',
			'ᵴ',
			'ᶊ',
			'ʂ',
			'ȿ',
			'ꜱ',
			'ʃ',
			'ſ',
			'ß',
			'ｓ'
		]
	},
	T: {
		base: 'T',
		variants: ['Ť', 'Ṫ', 'Ţ', 'Ṭ', 'Ț', 'Ṱ', 'Ṯ', 'Ŧ', 'Ⱦ', 'Ƭ', 'Ʈ', 'T̈', 'ᴛ', 'Ｔ']
	},
	t: {
		base: 't',
		variants: ['ť', 'ṫ', 'ţ', 'ṭ', 'ț', 'ṱ', 'ṯ', 'ŧ', 'ⱦ', 'ƭ', 'ʈ', 'ẗ', 'ᵵ', 'ƫ', 'ȶ', 'ᴛ', 'ｔ']
	},
	U: {
		base: 'U',
		variants: [
			'Ú',
			'Ù',
			'Ŭ',
			'Û',
			'Ǔ',
			'Ů',
			'Ü',
			'Ǘ',
			'Ǜ',
			'Ǚ',
			'Ǖ',
			'Ű',
			'Ũ',
			'Ṹ',
			'Ų',
			'Ū',
			'Ṻ',
			'Ủ',
			'Ȕ',
			'Ȗ',
			'Ư',
			'Ứ',
			'Ừ',
			'Ữ',
			'Ử',
			'Ự',
			'Ụ',
			'Ṳ',
			'Ṷ',
			'Ṵ',
			'Ʉ',
			'Ʊ',
			'Ȣ',
			'ᴜ',
			'Ｕ'
		]
	},
	u: {
		base: 'u',
		variants: [
			'ú',
			'ù',
			'ŭ',
			'û',
			'ǔ',
			'ů',
			'ü',
			'ǘ',
			'ǜ',
			'ǚ',
			'ǖ',
			'ű',
			'ũ',
			'ṹ',
			'ų',
			'ū',
			'ṻ',
			'ủ',
			'ȕ',
			'ȗ',
			'ư',
			'ứ',
			'ừ',
			'ữ',
			'ử',
			'ự',
			'ụ',
			'ṳ',
			'ṷ',
			'ṵ',
			'ʉ',
			'ʊ',
			'ȣ',
			'ᵾ',
			'ᶙ',
			'ᴜ',
			'ｕ',
			'ᵫ',
			'ɯ'
		]
	},
	V: {
		base: 'V',
		variants: ['Ṽ', 'Ṿ', 'Ʋ', 'Ʌ', 'ᴠ', 'Ｖ']
	},
	v: {
		base: 'v',
		variants: ['ṽ', 'ṿ', 'ʋ', 'ᶌ', 'ⱱ', 'ⱴ', 'ᴠ', 'ʌ', 'ｖ']
	},
	W: {
		base: 'W',
		variants: ['Ẃ', 'Ẁ', 'Ŵ', 'Ẅ', 'Ẇ', 'Ẉ', 'W̊', 'Ⱳ', 'ᴡ', 'Ｗ']
	},
	w: {
		base: 'w',
		variants: ['ẃ', 'ẁ', 'ŵ', 'ẅ', 'ẇ', 'ẉ', 'ẘ', 'ⱳ', 'ᴡ', 'ｗ', 'ʷ', 'ʍ', 'w̃']
	},
	X: {
		base: 'X',
		variants: ['Ẍ', 'Ẋ', 'Ｘ']
	},
	x: {
		base: 'x',
		variants: ['ẍ', 'ẋ', 'ᶍ', 'ｘ']
	},
	Y: {
		base: 'Y',
		variants: ['Ý', 'Ỳ', 'Ŷ', 'Ÿ', 'Ỹ', 'Ẏ', 'Ȳ', 'Ỷ', 'Ỵ', 'Ɏ', 'Ƴ', 'ʏ', 'Ｙ']
	},
	y: {
		base: 'y',
		variants: ['ý', 'ỳ', 'ŷ', 'ẙ', 'ÿ', 'ỹ', 'ẏ', 'ȳ', 'ỷ', 'ỵ', 'ɏ', 'ƴ', 'ʏ', 'ｙ']
	},
	Z: {
		base: 'Z',
		variants: [
			'Ź',
			'Ẑ',
			'Ž',
			'Ż',
			'Ẓ',
			'Ẕ',
			'Ƶ',
			'Ȥ',
			'Ⱬ',
			'Ʒ',
			'Ǯ',
			'Ƹ',
			'ᴢ',
			'Ｚ',
			'Ǳ',
			'Ž',
			'ž',
			'Ǆ'
		]
	},
	z: {
		base: 'z',
		variants: [
			'ź',
			'ẑ',
			'ž',
			'ż',
			'ẓ',
			'ẕ',
			'ƶ',
			'ȥ',
			'ⱬ',
			'ᵶ',
			'ᶎ',
			'ʐ',
			'ʑ',
			'ɀ',
			'ᴢ',
			'ʒ',
			'ǯ',
			'ƹ',
			'ｚ',
			'ǳ',
			'ǆ'
		]
	}
};

export const baseLatinCharacters = Object.keys(latinCharactersMap);
